# ExportBinary Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
STLExportOptions..::..ExportBinary Property
STLExportOptions Class See Also
---
True to export in binary STL format, false to export in ASCII STL format. Default value is true.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public bool ExportBinary { get; set; }
```

Visual Basic
---
```text
Public Property ExportBinary As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ExportBinary {
	bool get ();
	void set (bool value);
}
```

# See Also
STLExportOptions Class
Autodesk.Revit.DB Namespace